Autodesk.Revit.UI.Events.ViewActivatedEventArgs.PreviousActiveView
The previously active view.
Remarks:
May be null if there was no previously active view.
Since:
2010

Autodesk.Revit.UI.Events.ViewActivatedEventArgs.CurrentActiveView
The view that has just become active.
Since:
2010

Autodesk.Revit.UI.Events.ViewActivatedEventArgs
The event arguments used by the ViewActivated event.
Since:
2010